Revit 2027 API
MEPAnalyticalSegmentType Enumeration
 The type of analytical segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MEPAnalyticalSegmentType
Public Enumeration MEPAnalyticalSegmentType
public enum class MEPAnalyticalSegmentType
type MEPAnalyticalSegmentType
Members
Member name | Value | Description
Fitting | 2 |  The segment is fitting.
Loss | 4 |  The terminal loss (e.g., radiator, coil, etc.)
Pump | 3 |  The segment is pump.
Segment | 1 |  The segment is straight.
SourceEquipment | 5 |  The source equipment (e.g., chiller, boiler, etc.)
Undefined | 0 |  The segment is undefined.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace